app/controllers/users_controller.rb

  def create
    logger.debug "user_params: #{user_params}"
    user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password", "salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"